api_file/app/controllers/api/v1/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    tables = Table.all

SELECT "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @table = Table.find_by(id: params[:id])

SELECT "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tables" SET "name" = ?, "updated_at" = ? WHERE "tables"."id" = ?  [["name", "tabletest1"], ["updated_at", "2021-04-12 11:16:03.205003"], ["id", 6]]
---
  def update
    @table = Table.find(params[:id])
    if @table
      @table.update(table_params)

SELECT "tables".* FROM "tables" WHERE "tables"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tables" WHERE "tables"."id" = ?  [["id", 2]]
---
  def destroy
    @table = Table.find(params[:id])
    if @table
      @table.destroy